{
    "overview": {
        "image": "wsb-hero.jpg",
        "padding": "145%",
        "description": [
            "Kinetic Business by Windstream was a multi-year engagement, working on both the residential and small business sites, across many different projects including content pages, cart & checkout, and more.",
            "Initially taking ownership of the delivery from a previous vendor, we quickly worked to establish quality deliverables across the entire design and development stack. We implemented new processes to streamline communication and gained their trust by being transparent in the design process.", 
            "We created many designs for a multitude of different campaigns as well as continued to update the site with new branding initiatives each year. This included designing for the basic pages, such as About or Support, as well as new promotions, products, and service pages. We often gave recommendations on ways to make improvements across the full user experience as well as tools needed to better understand user metrics.",
            "To better help communicate the design to other departments, as well as streamline the design process, we created a full branding guide and shared that with all parties. We also added tools such as Invision and Zeplin to make the process of feedback quick and timely.", 
            "While deadlines were often tight and needed a short turn-around time, on most occasions we were able to do user research and provide recommendations on approaches to design challenges. Over the course of our engagement, we created hundreds of design collateral (mockups, wireframes, etc), and worked across hundreds of features and stories, helping make the two sites a truly enjoyable experience across all devices."
        ],
        "deliverables": "Product Strategy, Project Management, User Research, Data Analysis, IA, Visual Design, Interface Design, Interaction Design"
    },
    "sections": [
        {
            "type": "desktop",
            "alignment": "right",
            "image": "wsb-designsystem.jpg",
            "padding": "79%",
            "title": "Branding & Style Guide",
            "description": "From typography to buttons, forms, and interactions, the style guide was paramount in clear design communication. "
        },
        {
            "type": "desktop",
            "alignment": "left",
            "image": "wsb-flow.jpg",
            "title": "A comprehensive site structure",
            "description": "The site structure was completely redesigned to allow for business customers to more quickly see services and drive engagement to the cart."
        },
        {
            "type": "desktop",
            "alignment": "right",
            "image": "wsb-content.jpg",
            "title": "Content First",
            "description": "Pages were designed with clarity in mind. From services to support pages, each page was designed for maximum readability."
        },
        {
            "type": "desktop",
            "alignment": "left",
            "image": "wsr-cartflow.jpg",
            "title": "An improved experience",
            "description": "We streamlined the cart experience which increased engagement and reduced the time spent on checkout by 20%."
        },
        {
            "type": "desktop",
            "alignment": "right",
            "image": "wsb-cart.jpg",
            "title": "Better order outcomes",
            "description": "By reducing the number of steps, consolidating pages, increasing navigation legibility and more, we increased cart orders by more than 167% within a four month period."
        },
        {
            "type": "mobile",
            "alignment": "left",
            "image": [
                "wsb-mobile-ddos.jpg",
                "wsb-mobile-content.jpg",
                "wsb-mobile-cart.jpg"
            ],
            "title": "Fully responsive",
            "description": "The full site experience, from content pages to the cart & checkout, were fully responsive and worked great on mobile up to desktop."
        }
    ]
}
